#include "months.h"
#include "stdafx.h"
vector<pair<string, int>> months = {
    {"Январь", 31}, {"Февраль", 29}, {"Март", 31}, {"Апрель", 30}, {"Май", 31},
    {"Июнь", 30}, {"Июль", 31}, {"Август", 31}, {"Сентябрь", 30}, {"Октябрь", 31},
    {"Ноябрь", 30}, {"Декабрь", 31}
};

vector<pair<string, int>> holidays = {
    {"День программиста", 256}, {"День защитника отечества", 54}, {"Международный женский день", 67},
    {"День защиты детей", 152}, {"Новый год", 1}, {"Всемирный день знаний", 244},{"День когда горят огни рябин", 246},
    {"День спички", 61}
};